Infineon/AURIX_code_examples/code_examples/OneEye_UART_Oscilloscope_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxMinimcds_bf.h
/** \brief Length for Ifx_MINIMCDS_MCX_ACT_Bits.LV1 */
#define IFX_MINIMCDS_MCX_ACT_LV1_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MCX_ACT_Bits.LV1 */
#define IFX_MINIMCDS_MCX_ACT_LV1_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MCX_ACT_Bits.LV1 */
#define IFX_MINIMCDS_MCX_ACT_LV1_OFF (15u)

/** \brief Length for Ifx_MINIMCDS_MCX_ACT_Bits.AIS2 */
#define IFX_MINIMCDS_MCX_ACT_AIS2_LEN (5u)

/** \brief Mask for Ifx_MINIMCDS_MCX_ACT_Bits.AIS2 */
#define IFX_MINIMCDS_MCX_ACT_AIS2_MSK (0x1fu)

/** \brief Offset for Ifx_MINIMCDS_MCX_ACT_Bits.AIS2 */
#define IFX_MINIMCDS_MCX_ACT_AIS2_OFF (16u)

/** \brief Length for Ifx_MINIMCDS_MCX_ACT_Bits.AIQ2 */
#define IFX_MINIMCDS_MCX_ACT_AIQ2_LEN (2u)

/** \brief Mask for Ifx_MINIMCDS_MCX_ACT_Bits.AIQ2 */
#define IFX_MINIMCDS_MCX_ACT_AIQ2_MSK (0x3u)

/** \brief Offset for Ifx_MINIMCDS_MCX_ACT_Bits.AIQ2 */
#define IFX_MINIMCDS_MCX_ACT_AIQ2_OFF (21u)

/** \brief Length for Ifx_MINIMCDS_MCX_ACT_Bits.LV2 */
#define IFX_MINIMCDS_MCX_ACT_LV2_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MCX_ACT_Bits.LV2 */
#define IFX_MINIMCDS_MCX_ACT_LV2_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MCX_ACT_Bits.LV2 */
#define IFX_MINIMCDS_MCX_ACT_LV2_OFF (23u)

/** \brief Length for Ifx_MINIMCDS_MCX_ACT_Bits.AIS3 */
#define IFX_MINIMCDS_MCX_ACT_AIS3_LEN (5u)

/** \brief Mask for Ifx_MINIMCDS_MCX_ACT_Bits.AIS3 */
#define IFX_MINIMCDS_MCX_ACT_AIS3_MSK (0x1fu)

/** \brief Offset for Ifx_MINIMCDS_MCX_ACT_Bits.AIS3 */
#define IFX_MINIMCDS_MCX_ACT_AIS3_OFF (24u)

/** \brief Length for Ifx_MINIMCDS_MCX_ACT_Bits.AIQ3 */
#define IFX_MINIMCDS_MCX_ACT_AIQ3_LEN (2u)

/** \brief Mask for Ifx_MINIMCDS_MCX_ACT_Bits.AIQ3 */
#define IFX_MINIMCDS_MCX_ACT_AIQ3_MSK (0x3u)

/** \brief Offset for Ifx_MINIMCDS_MCX_ACT_Bits.AIQ3 */
#define IFX_MINIMCDS_MCX_ACT_AIQ3_OFF (29u)

/** \brief Length for Ifx_MINIMCDS_MCX_ACT_Bits.LV3 */
#define IFX_MINIMCDS_MCX_ACT_LV3_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MCX_ACT_Bits.LV3 */
#define IFX_MINIMCDS_MCX_ACT_LV3_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MCX_ACT_Bits.LV3 */
#define IFX_MINIMCDS_MCX_ACT_LV3_OFF (31u)

/** \brief Length for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.INC0 */
#define IFX_MINIMCDS_MCX_CNT_CCL_INC0_LEN (7u)

/** \brief Mask for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.INC0 */
#define IFX_MINIMCDS_MCX_CNT_CCL_INC0_MSK (0x7fu)

/** \brief Offset for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.INC0 */
#define IFX_MINIMCDS_MCX_CNT_CCL_INC0_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.ILV0 */
#define IFX_MINIMCDS_MCX_CNT_CCL_ILV0_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.ILV0 */
#define IFX_MINIMCDS_MCX_CNT_CCL_ILV0_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.ILV0 */
#define IFX_MINIMCDS_MCX_CNT_CCL_ILV0_OFF (7u)

/** \brief Length for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.CLR0 */
#define IFX_MINIMCDS_MCX_CNT_CCL_CLR0_LEN (6u)

/** \brief Mask for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.CLR0 */
#define IFX_MINIMCDS_MCX_CNT_CCL_CLR0_MSK (0x3fu)

/** \brief Offset for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.CLR0 */
#define IFX_MINIMCDS_MCX_CNT_CCL_CLR0_OFF (8u)

/** \brief Length for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.CLV0 */
#define IFX_MINIMCDS_MCX_CNT_CCL_CLV0_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.CLV0 */
#define IFX_MINIMCDS_MCX_CNT_CCL_CLV0_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.CLV0 */
#define IFX_MINIMCDS_MCX_CNT_CCL_CLV0_OFF (15u)

/** \brief Length for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.INC1 */
#define IFX_MINIMCDS_MCX_CNT_CCL_INC1_LEN (7u)

/** \brief Mask for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.INC1 */
#define IFX_MINIMCDS_MCX_CNT_CCL_INC1_MSK (0x7fu)

/** \brief Offset for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.INC1 */
#define IFX_MINIMCDS_MCX_CNT_CCL_INC1_OFF (16u)

/** \brief Length for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.ILV1 */
#define IFX_MINIMCDS_MCX_CNT_CCL_ILV1_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.ILV1 */
#define IFX_MINIMCDS_MCX_CNT_CCL_ILV1_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.ILV1 */
#define IFX_MINIMCDS_MCX_CNT_CCL_ILV1_OFF (23u)

/** \brief Length for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.CLR1 */
#define IFX_MINIMCDS_MCX_CNT_CCL_CLR1_LEN (6u)

/** \brief Mask for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.CLR1 */
#define IFX_MINIMCDS_MCX_CNT_CCL_CLR1_MSK (0x3fu)

/** \brief Offset for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.CLR1 */
#define IFX_MINIMCDS_MCX_CNT_CCL_CLR1_OFF (24u)

/** \brief Length for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.CLV1 */
#define IFX_MINIMCDS_MCX_CNT_CCL_CLV1_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.CLV1 */
#define IFX_MINIMCDS_MCX_CNT_CCL_CLV1_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MCX_CNT_CCL_Bits.CLV1 */
#define IFX_MINIMCDS_MCX_CNT_CCL_CLV1_OFF (31u)

/** \brief Length for Ifx_MINIMCDS_MCX_CNT_LMT_Bits.LIMIT */
#define IFX_MINIMCDS_MCX_CNT_LMT_LIMIT_LEN (16u)

/** \brief Mask for Ifx_MINIMCDS_MCX_CNT_LMT_Bits.LIMIT */
#define IFX_MINIMCDS_MCX_CNT_LMT_LIMIT_MSK (0xffffu)

/** \brief Offset for Ifx_MINIMCDS_MCX_CNT_LMT_Bits.LIMIT */
#define IFX_MINIMCDS_MCX_CNT_LMT_LIMIT_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_MCX_CNT_LMT_Bits.MOD0 */
#define IFX_MINIMCDS_MCX_CNT_LMT_MOD0_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MCX_CNT_LMT_Bits.MOD0 */
#define IFX_MINIMCDS_MCX_CNT_LMT_MOD0_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MCX_CNT_LMT_Bits.MOD0 */
#define IFX_MINIMCDS_MCX_CNT_LMT_MOD0_OFF (30u)

/** \brief Length for Ifx_MINIMCDS_MCX_CNT_LMT_Bits.MOD1 */
#define IFX_MINIMCDS_MCX_CNT_LMT_MOD1_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MCX_CNT_LMT_Bits.MOD1 */
#define IFX_MINIMCDS_MCX_CNT_LMT_MOD1_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MCX_CNT_LMT_Bits.MOD1 */
#define IFX_MINIMCDS_MCX_CNT_LMT_MOD1_OFF (31u)

/** \brief Length for Ifx_MINIMCDS_MCX_CNT_CNT_Bits.COUNT */
#define IFX_MINIMCDS_MCX_CNT_CNT_COUNT_LEN (16u)

/** \brief Mask for Ifx_MINIMCDS_MCX_CNT_CNT_Bits.COUNT */
#define IFX_MINIMCDS_MCX_CNT_CNT_COUNT_MSK (0xffffu)

/** \brief Offset for Ifx_MINIMCDS_MCX_CNT_CNT_Bits.COUNT */
#define IFX_MINIMCDS_MCX_CNT_CNT_COUNT_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.SUS */
#define IFX_MINIMCDS_TCX_DCSTS_SUS_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.SUS */
#define IFX_MINIMCDS_TCX_DCSTS_SUS_MSK (0x1u)

